LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
/**
 * ProxyClient.cpp — HTTP communication with the LilyGO proxy
 *
 * Rules enforced:
 *   - WiFi reconnect with exponential backoff (Article 2.4)
 *   - char[] buffers for JSON payloads (Article 2.2)
 *   - No delay() in any function callable from loop() (Article 2.1)
 */

#include "ProxyClient.h"
#include <esp_wifi.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiUdp.h>

#ifndef DISABLE_PROXY_UART
#define DISABLE_PROXY_UART 0
#endif

#ifndef DISABLE_PROXY_KEEPALIVE
#define DISABLE_PROXY_KEEPALIVE 0
#endif

#ifndef PROXY_UART_TIMEOUT_MS
#define PROXY_UART_TIMEOUT_MS 300
#endif

// ── Box identity (populated by scanForProxy()) ──
char WIFI_SSID[33]     = "";
char WIFI_PASSWORD[65] = "";
char HARDWARE_ID[12]   = "";
char EXPECTED_HARDWARE_ID[12] = "";
char EXPECTED_CONTROLLER_ID[20] = "";
char PROXY_HOST[16]    = "";

// ── UDP logger ──
static WiFiUDP udpClient;
static HardwareSerial proxySerial(1);
static bool proxyUartStarted = false;
static SemaphoreHandle_t proxyUartMutex = NULL;
static SemaphoreHandle_t proxyIoMutex = NULL;
static QueueHandle_t proxyPostQueue = NULL;
static TaskHandle_t proxyPostTaskHandle = NULL;
static uint16_t proxyRequestId = 1;
static unsigned long proxyUartRetryAt = 0;
static uint8_t proxyUartFailCount = 0;
static uint8_t proxyUartResetCount = 0;
static volatile uint32_t proxyPostQueuedCount = 0;
static volatile uint32_t proxyPostSentCount = 0;
static volatile uint32_t proxyPostFailCount = 0;
static volatile uint32_t proxyPostDropCount = 0;
static volatile uint32_t proxyIoBusyCount = 0;
static const char *volatile proxyIoOwner = "none";

struct ProxyPostJob {
  char path[32];
  char json[512];
  uint8_t attempts;
};

static void proxyPostTask(void *pvParameters);

static void ensureProxyAsync() {
  if (proxyIoMutex == NULL) {
    proxyIoMutex = xSemaphoreCreateRecursiveMutex();
  }
  if (proxyPostQueue == NULL) {
    proxyPostQueue = xQueueCreate(10, sizeof(ProxyPostJob));
  }
  if (proxyPostTaskHandle == NULL && proxyPostQueue != NULL) {
    xTaskCreatePinnedToCore(proxyPostTask, "ProxyPost", 6144, NULL, 1,
                            &proxyPostTaskHandle, 0);
  }
}

static bool takeProxyIo(uint32_t timeoutMs, const char *owner) {
  ensureProxyAsync();
  if (proxyIoMutex == NULL) return true;
  if (xSemaphoreTakeRecursive(proxyIoMutex, pdMS_TO_TICKS(timeoutMs)) == pdTRUE) {
    proxyIoOwner = owner ? owner : "unknown";
    return true;
  }
  proxyIoBusyCount++;
  return false;
}

static void giveProxyIo() {
  if (proxyIoMutex == NULL) return;
  proxyIoOwner = "none";
  xSemaphoreGiveRecursive(proxyIoMutex);
}

class ProxyIoGuard {
public:
  ProxyIoGuard(const char *owner, uint32_t timeoutMs)
      : _locked(takeProxyIo(timeoutMs, owner)) {}
  ~ProxyIoGuard() {
    if (_locked) giveProxyIo();
  }
  bool ok() const { return _locked; }

private:
  bool _locked;
};

// ── Delivery context ──
char  currentOtp[8]          = "";
char  activeDeliveryId[64]   = "";
bool  hasActiveDelivery      = false;
String lastStatusCommand     = "";
int16_t geoDistMeters        = -1;
bool    geoInsideFence       = false;
bool    isReturning          = false;
char    deliveryPhase[12]    = "NONE";
bool    pickupInsideFence    = false;
bool    dropoffInsideFence   = false;
char    deliveryContextState[12] = "UNKNOWN";
bool    deliveryContextStale = false;
bool    proxyRefreshQueued = false;
char    lastContextRefreshStatus[32] = "NONE";

// ── WiFi backoff state ──
static unsigned long wifiRetryAt    = 0;
static unsigned long wifiBackoffMs  = WIFI_RETRY_BASE_MS;
static unsigned long wifiRescanAt   = 0;
static unsigned long wifiConnectStartedAt = 0;
static uint8_t wifiReconnectAttempts = 0;
static uint8_t proxyBssid[6] = {0};
static bool proxyBssidKnown = false;
static int32_t proxyChannel = 0;
static uint8_t hotspotScanStart = 0;
static int8_t selectedHotspotCredential = -1;
static unsigned long nextProxyDiscoveryAt = 0;
static unsigned long nextProxySubnetProbeAt = 0;
static unsigned long proxyMissingReconnectAt = 0;
static uint8_t proxyDiscoveryMisses = 0;
static uint8_t subnetProbeHost = 2;
static const unsigned long PROXY_DISCOVERY_FAST_MS = 700UL;
static const unsigned long PROXY_SUBNET_PROBE_FAST_MS = 1000UL;
static const unsigned long PROXY_RECONNECT_DELAY_MS = 1000UL;
static const unsigned long PROXY_PROBE_TIMEOUT_MS = 90UL;
static const uint8_t PROXY_NEARBY_RADIUS = 8;
static const uint8_t PROXY_SUBNET_PROBE_HOSTS = 18;
static const uint8_t PROXY_RECONNECT_MISS_LIMIT = 8;

static void ensureControllerIdentity() {
  if (EXPECTED_HARDWARE_ID[0] == '\0') {
    snprintf(EXPECTED_HARDWARE_ID, sizeof(EXPECTED_HARDWARE_ID), "BOX_%03u",
             (unsigned int)CONTROLLER_BOX_NUM);
  }
  if (EXPECTED_CONTROLLER_ID[0] == '\0') {
    snprintf(EXPECTED_CONTROLLER_ID, sizeof(EXPECTED_CONTROLLER_ID),
             "CONTROLLER_%03u", (unsigned int)CONTROLLER_BOX_NUM);
  }
  if (HARDWARE_ID[0] == '\0') {
    strncpy(HARDWARE_ID, EXPECTED_HARDWARE_ID, sizeof(HARDWARE_ID) - 1);
    HARDWARE_ID[sizeof(HARDWARE_ID) - 1] = '\0';
  }
}

static bool proxyHardwareMatchesExpected(const char *hardwareId) {
  ensureControllerIdentity();
  return hardwareId && hardwareId[0] != '\0' &&
         strcmp(hardwareId, EXPECTED_HARDWARE_ID) == 0;
}

static void clearDiscoveredProxy(const char *reason) {
  if (PROXY_HOST[0] != '\0') {
    Serial.printf("[DISCOVERY] Clearing proxy %s (%s)\n",
                  PROXY_HOST, reason ? reason : "unknown");
  }
  PROXY_HOST[0] = '\0';
  nextProxyDiscoveryAt = 0;
}

static void rememberDiscoveredProxy(const IPAddress &ip, const char *hardwareId,
                                    const char *source) {
  if (!proxyHardwareMatchesExpected(hardwareId)) {
    Serial.printf("[DISCOVERY] Ignoring proxy %s for %s; expected %s\n",
                  hardwareId && hardwareId[0] ? hardwareId : "UNKNOWN",
                  source ? source : "probe", EXPECTED_HARDWARE_ID);
    return;
  }
  String ipStr = ip.toString();
  strncpy(PROXY_HOST, ipStr.c_str(), sizeof(PROXY_HOST) - 1);
  PROXY_HOST[sizeof(PROXY_HOST) - 1] = '\0';
  strncpy(HARDWARE_ID, EXPECTED_HARDWARE_ID, sizeof(HARDWARE_ID) - 1);
  HARDWARE_ID[sizeof(HARDWARE_ID) - 1] = '\0';
  proxyDiscoveryMisses = 0;
  nextProxyDiscoveryAt = millis() + 5000UL;
  nextProxySubnetProbeAt = millis() + 15000UL;
  proxyMissingReconnectAt = 0;
  Serial.printf("[DISCOVERY] Proxy at %s:%d via %s\n",
                PROXY_HOST, PROXY_PORT, source ? source : "probe");
}

