LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
static bool pingProxyAt(const IPAddress &ip, unsigned long timeoutMs) {
  WiFiClient client;
  client.setTimeout(1);
  bool connected = false;
#if defined(ESP_ARDUINO_VERSION_MAJOR)
  connected = client.connect(ip, PROXY_PORT, (int32_t)timeoutMs);
#else
  connected = client.connect(ip, PROXY_PORT);
#endif
  if (!connected) {
    client.stop();
    return false;
  }

  client.printf(
      "GET /identity HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "Connection: close\r\n"
      "\r\n",
      ip.toString().c_str(), PROXY_PORT);

  unsigned long deadline = millis() + timeoutMs;
  bool sawHttpOk = false;
  bool headersDone = false;
  String body = "";
  while (millis() < deadline && (client.connected() || client.available())) {
    if (!client.available()) {
      yield();
      continue;
    }
    String line = client.readStringUntil('\n');
    line.trim();
    if (line.startsWith("HTTP/1.1 200") || line.startsWith("HTTP/1.0 200")) {
      sawHttpOk = true;
    }
    if (line.length() == 0) {
      headersDone = true;
      continue;
    }
    if (headersDone) {
      body += line;
    }
  }
  client.stop();
  body.trim();
  return sawHttpOk && proxyHardwareMatchesExpected(body.c_str());
}

static bool tryProxyCandidate(const IPAddress &ip, const char *source,
                              unsigned long timeoutMs = PROXY_PROBE_TIMEOUT_MS) {
  if (ip == IPAddress(0, 0, 0, 0) || ip == WiFi.localIP()) return false;
  if (pingProxyAt(ip, timeoutMs)) {
    rememberDiscoveredProxy(ip, EXPECTED_HARDWARE_ID, source);
    return true;
  }
  return false;
}

static bool probeLikelyProxyHosts(uint8_t maxHosts = PROXY_SUBNET_PROBE_HOSTS) {
  if (WiFi.status() != WL_CONNECTED) return false;

  IPAddress gateway = WiFi.gatewayIP();
  if (tryProxyCandidate(gateway, "gateway")) return true;

  IPAddress local = WiFi.localIP();
  uint8_t tried = 0;

  // Phone hotspots often hand out adjacent DHCP leases. Probe the local
  // neighborhood before walking the whole /24 so recovery does not wait on
  // dozens of dead addresses.
  for (uint8_t delta = 1; delta <= PROXY_NEARBY_RADIUS && tried < maxHosts; delta++) {
    int lowerHost = (int)local[3] - (int)delta;
    if (lowerHost > 1 && lowerHost < 255) {
      IPAddress candidate(local[0], local[1], local[2], (uint8_t)lowerHost);
      tried++;
      if ((uint32_t)candidate != (uint32_t)gateway &&
          tryProxyCandidate(candidate, "nearby")) return true;
    }
    int upperHost = (int)local[3] + (int)delta;
    if (upperHost > 1 && upperHost < 255 && tried < maxHosts) {
      IPAddress candidate(local[0], local[1], local[2], (uint8_t)upperHost);
      tried++;
      if ((uint32_t)candidate != (uint32_t)gateway &&
          tryProxyCandidate(candidate, "nearby")) return true;
    }
  }

  while (tried < maxHosts) {
    if (subnetProbeHost == 0 || subnetProbeHost == 255) subnetProbeHost = 2;
    IPAddress candidate(local[0], local[1], local[2], subnetProbeHost);
    subnetProbeHost++;
    tried++;
    if ((uint32_t)candidate == (uint32_t)local ||
        (uint32_t)candidate == (uint32_t)gateway) {
      continue;
    }
    if (tryProxyCandidate(candidate, "subnet")) return true;
  }

  return false;
}

#if !DISABLE_PROXY_UART
static uint8_t checksum8(const char *text) {
  uint8_t sum = 0;
  if (!text) return 0;
  while (*text) {
    sum ^= (uint8_t)*text++;
  }
  return sum;
}

static void startProxyUart() {
  if (proxyUartMutex == NULL) {
    proxyUartMutex = xSemaphoreCreateMutex();
  }
  if (proxyUartStarted) return;
  pinMode(PROXY_UART_RX, INPUT_PULLUP);
  pinMode(PROXY_UART_TX, OUTPUT);
  digitalWrite(PROXY_UART_TX, HIGH);
  proxySerial.begin(PROXY_UART_BAUD, SERIAL_8N1, PROXY_UART_RX, PROXY_UART_TX);
  proxySerial.setTimeout(PROXY_UART_TIMEOUT_MS);
  proxyUartStarted = true;
  Serial.printf("[PROXY-UART] Serial1 ready RX=%d TX=%d baud=%d\n",
                PROXY_UART_RX, PROXY_UART_TX, PROXY_UART_BAUD);
}

static void resetProxyUart(const char *reason) {
  Serial.printf("[PROXY-UART] Resetting Serial1 (%s)\n",
                reason ? reason : "unknown");
  proxySerial.end();
  vTaskDelay(pdMS_TO_TICKS(20));
  pinMode(PROXY_UART_RX, INPUT_PULLUP);
  pinMode(PROXY_UART_TX, OUTPUT);
  digitalWrite(PROXY_UART_TX, HIGH);
  proxySerial.begin(PROXY_UART_BAUD, SERIAL_8N1, PROXY_UART_RX, PROXY_UART_TX);
  proxySerial.setTimeout(PROXY_UART_TIMEOUT_MS);
  while (proxySerial.available()) proxySerial.read();
}

static bool proxyUartRequest(const char *method, const char *path,
                             const char *payload, String &bodyOut,
                             unsigned long timeoutMs = PROXY_UART_TIMEOUT_MS) {
  startProxyUart();
  bool haveMutex = false;
  if (proxyUartMutex != NULL) {
    haveMutex = (xSemaphoreTake(proxyUartMutex,
                                pdMS_TO_TICKS(timeoutMs + 250UL)) == pdTRUE);
    if (!haveMutex) {
      Serial.printf("[PROXY-UART] Busy timeout %s %s\n",
                    method ? method : "GET", path ? path : "/");
      return false;
    }
  }
  while (proxySerial.available()) proxySerial.read();

  bool canRetry = (method != NULL && strcmp(method, "GET") == 0);
  uint8_t attempts = canRetry ? PROXY_UART_GET_RETRIES : 1;
  if (attempts < 1) attempts = 1;

  uint16_t lastId = 0;
  uint16_t totalRxBytes = 0;
  uint8_t totalBadChecksum = 0;
  uint8_t totalWrongId = 0;
  uint8_t totalMalformed = 0;
  char firstLine[96] = "";

  for (uint8_t attempt = 1; attempt <= attempts; attempt++) {
    uint16_t id = proxyRequestId++;
    if (proxyRequestId == 0) proxyRequestId = 1;
    lastId = id;

    char frame[760];
    snprintf(frame, sizeof(frame), "REQ|%u|%s|%s|%s",
             (unsigned int)id, method ? method : "GET", path ? path : "/",
             payload ? payload : "");
    uint8_t sum = checksum8(frame);
    proxySerial.printf("%s|%02X\n", frame, sum);
    proxySerial.flush();

    unsigned long deadline = millis() + timeoutMs;
    char line[900];
    uint16_t len = 0;

    while (millis() < deadline) {
      while (proxySerial.available()) {
        char c = (char)proxySerial.read();
        totalRxBytes++;
        if (c == '\r') continue;
        if (c == '\n') {
          line[len] = '\0';
          len = 0;

          String resp(line);
          if (firstLine[0] == '\0') {
            strncpy(firstLine, line, sizeof(firstLine) - 1);
            firstLine[sizeof(firstLine) - 1] = '\0';
          }
          if (!resp.startsWith("RESP|")) {
            totalMalformed++;
            continue;
          }
          int p1 = resp.indexOf('|', 5);
          int p2 = (p1 >= 0) ? resp.indexOf('|', p1 + 1) : -1;
          int p3 = (p2 >= 0) ? resp.lastIndexOf('|') : -1;
          if (p1 < 0 || p2 < 0 || p3 <= p2) {
            totalMalformed++;
            continue;
          }

          uint16_t respId = (uint16_t)resp.substring(5, p1).toInt();
          if (respId != id) {
            totalWrongId++;
            continue;
          }

          String withoutCrc = resp.substring(0, p3);
          uint8_t expected = (uint8_t)strtoul(resp.substring(p3 + 1).c_str(), NULL, 16);
          if (checksum8(withoutCrc.c_str()) != expected) {
            totalBadChecksum++;
            Serial.println(F("[PROXY-UART] Ignored bad checksum"));
            continue;
          }

          int status = resp.substring(p1 + 1, p2).toInt();
          bodyOut = resp.substring(p2 + 1, p3);
          Serial.printf("[PROXY-UART] Response id=%u status=%d len=%u attempt=%u\n",
                        (unsigned int)id, status,
                        (unsigned int)bodyOut.length(), (unsigned int)attempt);
          proxyUartResetCount = 0;
          if (haveMutex) xSemaphoreGive(proxyUartMutex);
          return status >= 200 && status < 300;
        }
        if (len < sizeof(line) - 1) {
          line[len++] = c;
        } else {
          len = 0;
        }
      }
      yield();
    }

