LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
    if (attempt < attempts) {
      vTaskDelay(pdMS_TO_TICKS(30));
      while (proxySerial.available()) proxySerial.read();
    }
  }

  Serial.printf("[PROXY-UART] Timeout id=%u %s %s attempts=%u rxBytes=%u badCrc=%u wrongId=%u malformed=%u first='%s'\n",
                (unsigned int)lastId, method ? method : "GET", path ? path : "/",
                (unsigned int)attempts, (unsigned int)totalRxBytes,
                (unsigned int)totalBadChecksum, (unsigned int)totalWrongId,
                (unsigned int)totalMalformed, firstLine);

  if (totalRxBytes == 0 || totalBadChecksum > 0 || totalMalformed > 1) {
    if (proxyUartResetCount < 255) proxyUartResetCount++;
    if (proxyUartResetCount >= 3) {
      resetProxyUart(totalRxBytes == 0 ? "no_rx" : "bad_frames");
      proxyUartResetCount = 0;
    }
  }
  if (haveMutex) xSemaphoreGive(proxyUartMutex);
  return false;
}

static bool proxyUartPrimaryRequest(const char *method, const char *path,
                                    const char *payload, String &bodyOut,
                                    unsigned long timeoutMs,
                                    bool force = false) {
  unsigned long now = millis();
  if (!force && now < proxyUartRetryAt) {
    return false;
  }

  if (proxyUartRequest(method, path, payload, bodyOut, timeoutMs)) {
    proxyUartRetryAt = 0;
    proxyUartFailCount = 0;
    return true;
  }

  if (proxyUartFailCount < 20) {
    proxyUartFailCount++;
  }
  unsigned long cooldown = 5000UL + ((unsigned long)proxyUartFailCount * 500UL);
  if (cooldown > 10000UL) {
    cooldown = 10000UL;
  }
  proxyUartRetryAt = now + cooldown;
  return false;
}
#else
static void startProxyUart() {}

static void resetProxyUart(const char *reason) {
  (void)reason;
}

static bool proxyUartRequest(const char *method, const char *path,
                             const char *payload, String &bodyOut,
                             unsigned long timeoutMs = 0) {
  (void)method;
  (void)path;
  (void)payload;
  (void)bodyOut;
  (void)timeoutMs;
  return false;
}

static bool proxyUartPrimaryRequest(const char *method, const char *path,
                                    const char *payload, String &bodyOut,
                                    unsigned long timeoutMs,
                                    bool force = false) {
  (void)method;
  (void)path;
  (void)payload;
  (void)bodyOut;
  (void)timeoutMs;
  (void)force;
  return false;
}
#endif

static bool discoverProxyUdp(unsigned long timeoutMs = 1200) {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiUDP discovery;
  // Use a fixed receive port. Some phone hotspots pass broadcast discovery
  // but drop replies to random high UDP source ports.
  if (!discovery.begin(PROXY_DISCOVERY_PORT)) {
    Serial.printf("[DISCOVERY] UDP begin(%d) failed\n", PROXY_DISCOVERY_PORT);
    return false;
  }

  IPAddress broadcast((uint32_t)WiFi.localIP() | ~(uint32_t)WiFi.subnetMask());

  unsigned long deadline = millis() + timeoutMs;
  char packet[96];
  unsigned long nextQueryAt = 0;
  while (millis() < deadline) {
    unsigned long now = millis();
    if (now >= nextQueryAt) {
      discovery.beginPacket(broadcast, PROXY_DISCOVERY_PORT);
      discovery.print(PROXY_DISCOVERY_QUERY);
      discovery.endPacket();
      nextQueryAt = now + 250;
    }

    int size = discovery.parsePacket();
    if (size > 0) {
      int len = discovery.read(packet, sizeof(packet) - 1);
      if (len < 0) len = 0;
      packet[len] = '\0';
      if (strncmp(packet, PROXY_DISCOVERY_REPLY,
                  strlen(PROXY_DISCOVERY_REPLY)) == 0) {
        const char *payload = packet + strlen(PROXY_DISCOVERY_REPLY);
        char replyIp[16] = "";
        int replyPort = PROXY_PORT;
        char replyHardware[12] = "";

        int parsed = sscanf(payload, "%15[^:]:%d:%11s",
                            replyIp, &replyPort, replyHardware);
        if (!proxyHardwareMatchesExpected(parsed >= 3 ? replyHardware : NULL)) {
          Serial.printf("[DISCOVERY] Ignoring proxy reply %s; expected %s\n",
                        parsed >= 3 ? replyHardware : "UNKNOWN",
                        EXPECTED_HARDWARE_ID);
          continue;
        }
        IPAddress ip;
        if (parsed >= 1 && ip.fromString(replyIp)) {
          rememberDiscoveredProxy(ip, parsed >= 3 ? replyHardware : NULL, "udp");
        } else {
          ip = discovery.remoteIP();
          rememberDiscoveredProxy(ip, parsed >= 3 ? replyHardware : NULL, "udp_remote");
        }
        Serial.printf("[DISCOVERY] Proxy at %s:%d (%s)\n",
                      PROXY_HOST, replyPort, packet);
        discovery.stop();
        return true;
      }
    }
    delay(20);
  }
  discovery.stop();
  if (proxyDiscoveryMisses < 255) proxyDiscoveryMisses++;
  Serial.printf("[DISCOVERY] Proxy discovery timed out (%u)\n",
                proxyDiscoveryMisses);
  if (proxyDiscoveryMisses >= 1 && millis() >= nextProxySubnetProbeAt) {
    nextProxySubnetProbeAt = millis() + PROXY_SUBNET_PROBE_FAST_MS;
    Serial.println(F("[DISCOVERY] UDP failed; probing likely proxy IPs"));
    if (probeLikelyProxyHosts()) {
      return true;
    }
  }
  return false;
}

// ── Fetch reliability controls ──
static const uint16_t FETCH_HTTP_TIMEOUT_MS = 5000;
static const uint16_t REFRESH_HTTP_TIMEOUT_MS = 2500;
static unsigned long lastFetchSuccessAt = 0;
static unsigned long lastGeoContextAt = 0;
static uint8_t fetchFailCount = 0;
static bool geoContextKnown = false;
static const uint8_t FETCH_FAIL_RESET_THRESHOLD = 20;

bool isGeoContextFresh(unsigned long maxAgeMs) {
  if (!geoContextKnown || lastGeoContextAt == 0) return false;
  return (millis() - lastGeoContextAt) <= maxAgeMs;
}

unsigned long getGeoContextAgeMs() {
  if (!geoContextKnown || lastGeoContextAt == 0) return 0xFFFFFFFFUL;
  return millis() - lastGeoContextAt;
}

static void hardResetDeliveryContext(const char *reason) {
  if (!hasActiveDelivery && currentOtp[0] == '\0' && activeDeliveryId[0] == '\0' &&
      lastStatusCommand.length() == 0) {
    return;
  }

  currentOtp[0] = '\0';
  activeDeliveryId[0] = '\0';
  hasActiveDelivery = false;
  lastStatusCommand = "";
  geoDistMeters = -1;
  geoInsideFence = false;
  isReturning = false;
  geoContextKnown = false;
  lastGeoContextAt = 0;
  strncpy(deliveryPhase, "NONE", sizeof(deliveryPhase) - 1);
  deliveryPhase[sizeof(deliveryPhase) - 1] = '\0';
  pickupInsideFence = false;
  dropoffInsideFence = false;
  strncpy(deliveryContextState, "UNKNOWN", sizeof(deliveryContextState) - 1);
  deliveryContextState[sizeof(deliveryContextState) - 1] = '\0';
  deliveryContextStale = false;
  proxyRefreshQueued = false;
  netLog("[FETCH] Hard reset delivery context (%s)\n",
         reason ? reason : "unknown");
}

static void noteFetchFailure(const char *stage) {
  if (fetchFailCount < 255) {
    fetchFailCount++;
  }

  netLog("[FETCH] %s failed (%u/%u)\n",
         stage ? stage : "request",
         fetchFailCount,
         FETCH_FAIL_RESET_THRESHOLD);

  if (fetchFailCount < FETCH_FAIL_RESET_THRESHOLD) {
    return;
  }

  unsigned long now = millis();
  bool hasFreshContext =
      hasActiveDelivery &&
      lastFetchSuccessAt > 0 &&
      (now - lastFetchSuccessAt) <= FETCH_CONTEXT_STICKY_MS;

  if (hasFreshContext || hasActiveDelivery) {
    deliveryContextStale = true;
    strncpy(deliveryContextState, "STALE", sizeof(deliveryContextState) - 1);
    deliveryContextState[sizeof(deliveryContextState) - 1] = '\0';
    netLog("[FETCH] Preserving cached delivery during proxy/cloud blip (%lums old)\n",
           lastFetchSuccessAt > 0 ? (now - lastFetchSuccessAt) : 0);
    fetchFailCount = FETCH_FAIL_RESET_THRESHOLD / 2;
    return;
  }

  fetchFailCount = 0;
  hardResetDeliveryContext(stage);
}

static String normalizeStatusToken(const String &rawToken) {
  String token = rawToken;
  token.trim();

  // Some upstream paths may include JSON quotes around text values.
  if (token.length() >= 2 && token[0] == '"' && token[token.length() - 1] == '"') {
    token = token.substring(1, token.length() - 1);
    token.trim();
  }

  if (token == "UNLOCKING" || token == "LOCKED" || token == "REBOOT_ALL") {
    return token;
  }

