LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
  return "";
}

static bool parseDiagField(const String &body, const char *key, String &out) {
  String token = String(key) + "=";
  int start = body.indexOf(token);
  if (start < 0) {
    return false;
  }

  start += token.length();
  int end = body.indexOf(',', start);
  if (end < 0) {
    end = body.length();
  }

  out = body.substring(start, end);
  out.trim();
  return out.length() > 0;
}

// ==================== LOGGING ====================
#if CONTROLLER_VERBOSE_LOGS
void netLog(const char *format, ...) {
  char buf[256];
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format, args);
  va_end(args);

  Serial.print(buf);

  if (WiFi.status() == WL_CONNECTED && PROXY_HOST[0] != '\0') {
    udpClient.beginPacket(PROXY_HOST, UDP_LOG_PORT);
    udpClient.print("[ESP32] ");
    udpClient.print(buf);
    udpClient.endPacket();
  }
}
#endif

// ==================== WIFI ====================
bool scanForProxy() {
#if CONTROLLER_VERBOSE_LOGS
  Serial.println("[WIFI] Scanning for configured hotspots...");
#endif
  int n = WiFi.scanNetworks();
#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[WIFI] Found %d networks\n", n);
#endif

  int bestIdx = -1;
  int bestRssi = -999;
  int bestCredential = -1;
  for (int i = 0; i < n; i++) {
    String ssid = WiFi.SSID(i);
#if CONTROLLER_VERBOSE_LOGS
    Serial.printf("[WIFI]   %s (%d dBm)\n", ssid.c_str(), WiFi.RSSI(i));
#endif
  }

  for (uint8_t offset = 0; offset < HOTSPOT_COUNT; offset++) {
    uint8_t h = (hotspotScanStart + offset) % HOTSPOT_COUNT;
    if (!HOTSPOTS[h].ssid || HOTSPOTS[h].ssid[0] == '\0') continue;
    for (int i = 0; i < n; i++) {
      if (WiFi.SSID(i) == HOTSPOTS[h].ssid && WiFi.RSSI(i) > bestRssi) {
        bestRssi = WiFi.RSSI(i);
        bestIdx = i;
        bestCredential = h;
      }
    }
  }

  if (bestIdx >= 0 && bestCredential >= 0) {
    String ssid = WiFi.SSID(bestIdx);
    strncpy(WIFI_SSID, ssid.c_str(), sizeof(WIFI_SSID) - 1);
    WIFI_SSID[sizeof(WIFI_SSID) - 1] = '\0';
    strncpy(WIFI_PASSWORD, HOTSPOTS[bestCredential].password,
            sizeof(WIFI_PASSWORD) - 1);
    WIFI_PASSWORD[sizeof(WIFI_PASSWORD) - 1] = '\0';
    proxyChannel = WiFi.channel(bestIdx);
    uint8_t *bssid = WiFi.BSSID(bestIdx);
    if (bssid) {
      memcpy(proxyBssid, bssid, sizeof(proxyBssid));
      proxyBssidKnown = true;
    } else {
      proxyBssidKnown = false;
    }

    ensureControllerIdentity();
    selectedHotspotCredential = bestCredential;

#if CONTROLLER_VERBOSE_LOGS
    Serial.printf("[WIFI] Selected hotspot: %s (%d dBm, ch %ld) -> %s\n",
                  WIFI_SSID, bestRssi, (long)proxyChannel, HARDWARE_ID);
#endif
    WiFi.scanDelete();
    return true;
  }

  WiFi.scanDelete();
#if CONTROLLER_VERBOSE_LOGS
  Serial.println("[WIFI] No configured hotspot found!");
#endif
  return false;
}

static void advanceHotspotCandidate(const char *reason) {
  if (selectedHotspotCredential >= 0 && HOTSPOT_COUNT > 0) {
    hotspotScanStart = ((uint8_t)selectedHotspotCredential + 1) % HOTSPOT_COUNT;
    Serial.printf("[WIFI] Advancing hotspot after %s; next scan starts at #%u\n",
                  reason ? reason : "failure", hotspotScanStart);
  }
  WIFI_SSID[0] = '\0';
  WIFI_PASSWORD[0] = '\0';
  proxyBssidKnown = false;
  proxyChannel = 0;
}

static void beginProxyConnection(const char *reason) {
  if (WIFI_SSID[0] == '\0') {
    return;
  }

  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(true);
  WiFi.setSleep(false);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_max_tx_power(78); // 19.5 dBm, units are quarter-dBm.

#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[WIFI] Begin %s -> %s", reason ? reason : "connect", WIFI_SSID);
#endif
  if (proxyChannel > 0 && proxyBssidKnown) {
#if CONTROLLER_VERBOSE_LOGS
    Serial.printf(" (ch %ld, BSSID locked)", (long)proxyChannel);
#endif
    WiFi.begin((const char *)WIFI_SSID, WIFI_PASSWORD, proxyChannel, proxyBssid, true);
  } else {
    WiFi.begin((const char *)WIFI_SSID, WIFI_PASSWORD);
  }
#if CONTROLLER_VERBOSE_LOGS
  Serial.println();
#endif

  wifiConnectStartedAt = millis();
  nextProxyDiscoveryAt = 0;
  nextProxySubnetProbeAt = 0;
  proxyMissingReconnectAt = 0;
  proxyDiscoveryMisses = 0;
  subnetProbeHost = 2;
  if (wifiReconnectAttempts < 255) {
    wifiReconnectAttempts++;
  }
}

void startWiFiConnection() {
  ensureProxyAsync();
  startProxyUart();
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(true);
  // SoftAP link is local and latency-sensitive; disable modem sleep to reduce
  // intermittent HTTP read timeouts (e.g., HTTP -11) on frequent /otp polling.
  WiFi.setSleep(false);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_max_tx_power(78);
  if (WIFI_SSID[0] == '\0') {
    scanForProxy();
  }
  beginProxyConnection("initial");
  wifiRetryAt  = millis() + WIFI_FIRST_RETRY_DELAY_MS;
  wifiRescanAt = millis() + WIFI_RESCAN_INTERVAL_MS;
  wifiBackoffMs = WIFI_RETRY_BASE_MS;
}

// Forward declaration — defined below with persistent connection helpers.
static void closePersistentConnection();

void maintainWiFiConnection(unsigned long now) {
  if (WiFi.status() == WL_CONNECTED) {
    if (PROXY_HOST[0] == '\0' && now >= nextProxyDiscoveryAt) {
      nextProxyDiscoveryAt = now + PROXY_DISCOVERY_FAST_MS;
      if (!discoverProxyUdp(250) && proxyDiscoveryMisses >= 1 &&
          now >= nextProxySubnetProbeAt) {
        nextProxySubnetProbeAt = now + PROXY_SUBNET_PROBE_FAST_MS;
        probeLikelyProxyHosts(PROXY_SUBNET_PROBE_HOSTS);
      }
    }
    if (PROXY_HOST[0] == '\0' && proxyDiscoveryMisses >= PROXY_RECONNECT_MISS_LIMIT) {
      if (proxyMissingReconnectAt == 0) {
        proxyMissingReconnectAt = now + PROXY_RECONNECT_DELAY_MS;
      } else if (now >= proxyMissingReconnectAt) {
        Serial.println(F("[DISCOVERY] Proxy still missing; rescanning hotspots"));
        closePersistentConnection();
        advanceHotspotCandidate("proxy_missing");
        WiFi.disconnect();
        scanForProxy();
        beginProxyConnection("proxy_missing");
        proxyDiscoveryMisses = 0;
        proxyMissingReconnectAt = 0;
        return;
      }
    } else {
      proxyMissingReconnectAt = 0;
    }
    wifiBackoffMs = WIFI_RETRY_BASE_MS;
    wifiRetryAt = now + WIFI_FIRST_RETRY_DELAY_MS;
    wifiRescanAt = now + WIFI_RESCAN_INTERVAL_MS;
    wifiConnectStartedAt = 0;
    wifiReconnectAttempts = 0;
    return;
  }

  if (wifiConnectStartedAt > 0 &&
      (now - wifiConnectStartedAt) < WIFI_CONNECT_ATTEMPT_MS) {
    return;
  }

