LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
  int firstComma  = body.indexOf(',');
  int secondComma = (firstComma > 0) ? body.indexOf(',', firstComma + 1) : -1;
  int thirdComma  = (secondComma > 0) ? body.indexOf(',', secondComma + 1) : -1;

  if (firstComma > 0) {
    String otpPart = body.substring(0, firstComma);
    String delPart;
    String statusPart = "";

    if (secondComma > 0) {
      delPart = body.substring(firstComma + 1, secondComma);
      statusPart = (thirdComma > 0) ? body.substring(secondComma + 1, thirdComma)
                                    : body.substring(secondComma + 1);
    } else {
      delPart = body.substring(firstComma + 1);
    }

    String parsedStatusCommand = normalizeStatusToken(statusPart);
    if (updateStatusCommand) {
      lastStatusCommand = parsedStatusCommand;
    }

    bool sawGeoToken = false;
    int distIdx = body.indexOf("DIST:");
    if (distIdx >= 0) {
      int valStart = distIdx + 5;
      int valEnd = body.indexOf(',', valStart);
      if (valEnd < 0) valEnd = body.length();
      geoDistMeters = (int16_t)body.substring(valStart, valEnd).toInt();
      sawGeoToken = true;
    }
    int geoIdx = body.indexOf("GEO:");
    if (geoIdx >= 0) {
      geoInsideFence = (body.charAt(geoIdx + 4) == '1');
      sawGeoToken = true;
    }
    int retIdx = body.indexOf("RET:");
    if (retIdx >= 0) isReturning = (body.charAt(retIdx + 4) == '1');

    bool phaseParsed = false;
    int phaseIdx = body.indexOf("PHASE:");
    if (phaseIdx >= 0) {
      int valStart = phaseIdx + 6;
      int valEnd = body.indexOf(',', valStart);
      if (valEnd < 0) valEnd = body.length();
      String phase = body.substring(valStart, valEnd);
      phase.trim();
      if (phase.length() > 0 && phase.length() < (int)sizeof(deliveryPhase)) {
        strncpy(deliveryPhase, phase.c_str(), sizeof(deliveryPhase) - 1);
        deliveryPhase[sizeof(deliveryPhase) - 1] = '\0';
        phaseParsed = true;
      }
    }
    if (!phaseParsed) {
      strncpy(deliveryPhase, "NONE", sizeof(deliveryPhase) - 1);
      deliveryPhase[sizeof(deliveryPhase) - 1] = '\0';
    }

    int pupIdx = body.indexOf("PUP:");
    if (pupIdx >= 0) {
      pickupInsideFence = (body.charAt(pupIdx + 4) == '1');
      sawGeoToken = true;
    }
    int droIdx = body.indexOf("DRO:");
    if (droIdx >= 0) {
      dropoffInsideFence = (body.charAt(droIdx + 4) == '1');
      sawGeoToken = true;
    }
    int ctxIdx = body.indexOf("CTX:");
    if (ctxIdx >= 0) {
      int valStart = ctxIdx + 4;
      int valEnd = body.indexOf(',', valStart);
      if (valEnd < 0) valEnd = body.length();
      String ctx = body.substring(valStart, valEnd);
      ctx.trim();
      if (ctx.length() > 0 && ctx.length() < (int)sizeof(deliveryContextState)) {
        strncpy(deliveryContextState, ctx.c_str(), sizeof(deliveryContextState) - 1);
        deliveryContextState[sizeof(deliveryContextState) - 1] = '\0';
      }
      deliveryContextStale = (strcmp(deliveryContextState, "STALE") == 0);
    }
    int refqIdx = body.indexOf("REFQ:");
    if (refqIdx >= 0) {
      proxyRefreshQueued = (body.charAt(refqIdx + 5) == '1');
    }

    bool validOtp = (otpPart != "NO_OTP" && otpPart != "null" &&
                     otpPart.length() > 0 && otpPart.length() <= 6);
    bool validDel = (delPart != "NO_DELIVERY" && delPart != "null" &&
                     delPart.length() > 0);

    if (validOtp) {
      strncpy(currentOtp, otpPart.c_str(), sizeof(currentOtp) - 1);
      currentOtp[sizeof(currentOtp) - 1] = '\0';
    } else {
      currentOtp[0] = '\0';
    }
    if (validDel) {
      strncpy(activeDeliveryId, delPart.c_str(), sizeof(activeDeliveryId) - 1);
      activeDeliveryId[sizeof(activeDeliveryId) - 1] = '\0';
    } else {
      activeDeliveryId[0] = '\0';
    }

    hasActiveDelivery = validDel;
    if (!hasActiveDelivery) {
      strncpy(deliveryPhase, "NONE", sizeof(deliveryPhase) - 1);
      deliveryPhase[sizeof(deliveryPhase) - 1] = '\0';
      pickupInsideFence = false;
      dropoffInsideFence = false;
      deliveryContextStale = false;
      proxyRefreshQueued = false;
    }
    geoContextKnown = hasActiveDelivery && sawGeoToken;
    if (geoContextKnown) {
      lastGeoContextAt = millis();
    } else {
      lastGeoContextAt = 0;
    }
    netLog("[FETCH] otp=%d del=%d dist=%d geo=%d ret=%d phase=%s pup=%d dro=%d cmd='%s'\n",
           validOtp, validDel, geoDistMeters, geoInsideFence ? 1 : 0,
           isReturning ? 1 : 0, deliveryPhase,
           pickupInsideFence ? 1 : 0, dropoffInsideFence ? 1 : 0,
           lastStatusCommand.c_str());
    return;
  }

  if (body != "NO_OTP" && body != "null" && body.length() > 0 &&
      body.length() <= 6) {
    strncpy(currentOtp, body.c_str(), sizeof(currentOtp) - 1);
    currentOtp[sizeof(currentOtp) - 1] = '\0';
    hasActiveDelivery = true;
    geoContextKnown = false;
    lastGeoContextAt = 0;
    strncpy(deliveryContextState, "LEGACY", sizeof(deliveryContextState) - 1);
    deliveryContextState[sizeof(deliveryContextState) - 1] = '\0';
    deliveryContextStale = false;
    proxyRefreshQueued = false;
  } else {
    currentOtp[0] = '\0';
    activeDeliveryId[0] = '\0';
    hasActiveDelivery = false;
    geoContextKnown = false;
    lastGeoContextAt = 0;
    strncpy(deliveryContextState, "UNKNOWN", sizeof(deliveryContextState) - 1);
    deliveryContextState[sizeof(deliveryContextState) - 1] = '\0';
    deliveryContextStale = false;
    proxyRefreshQueued = false;
  }
}

static bool fetchDeliveryContextInternal(bool updateStatusCommand) {
  String uartBody;

  if (WiFi.status() != WL_CONNECTED) {
    closePersistentConnection();
    if (proxyUartPrimaryRequest("GET", "/otp", "", uartBody,
                                PROXY_UART_TIMEOUT_MS)) {
      netLog("[FETCH] UART fallback OK\n");
      parseOtpBody(uartBody, updateStatusCommand);
      return true;
    }
    netLog("[FETCH] Skip — no primary transport available\n");
    return false;
  }

  ProxyIoGuard io(updateStatusCommand ? "fetchDeliveryContext" : "geoCacheFetch", 100);
  if (!io.ok()) {
    if (updateStatusCommand) noteFetchFailure("proxy_io_busy");
    return false;
  }

#if DISABLE_PROXY_KEEPALIVE
  String body = "";
  int code = httpGetOnce("/otp", body, FETCH_HTTP_TIMEOUT_MS);
  netLog("[FETCH] HTTP %d\n", code);
  if (code != 200) {
    if (updateStatusCommand) noteFetchFailure("http_non_200");
    return false;
  }
  parseOtpBody(body, updateStatusCommand);
  return true;
#else
  // Ensure persistent TCP socket is alive.
  if (!ensurePersistentConnection()) {
    if (updateStatusCommand) noteFetchFailure("tcp_connect");
    return false;
  }

  // Send raw HTTP/1.1 GET with keep-alive.
  persistentClient.printf(
      "GET /otp HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "X-Controller-Id: %s\r\n"
      "Connection: keep-alive\r\n"
      "\r\n",
      PROXY_HOST, PROXY_PORT, EXPECTED_CONTROLLER_ID);

