LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
  WiFiClient client;
  HTTPClient http;
  char url[64];
  snprintf(url, sizeof(url), "http://%s:%d/diag", PROXY_HOST, PROXY_PORT);

  http.setTimeout(CONTROLLER_DIAG_HTTP_TIMEOUT_MS);
  http.setReuse(false);
  http.begin(client, url);
  http.addHeader("X-Controller-Id", EXPECTED_CONTROLLER_ID);

  int code = http.GET();
  if (code != 200) {
    netLog("[DIAG] GET /diag HTTP %d\n", code);
    http.end();
    return false;
  }

  String body = http.getString();
  http.end();

  String field;
  ControllerDiagData parsed = out;
  bool parsedAny = false;

  if (parseDiagField(body, "batt_pct", field)) {
    parsed.battPct = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "batt_v", field)) {
    parsed.battVoltage = field.toFloat();
    parsedAny = true;
  }
  if (parseDiagField(body, "rssi", field)) {
    parsed.rssi = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "csq", field)) {
    parsed.csq = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "gps_fix", field)) {
    parsed.gpsFix = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "lte", field)) {
    parsed.lteConnected = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "modem", field)) {
    parsed.modemOk = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "time", field)) {
    parsed.timeSynced = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "cam_up", field)) {
    parsed.camUp = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "ctrl_up", field)) {
    parsed.controllerUp = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "fb_fail", field)) {
    parsed.firebaseFailures = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "cmd_stage", field)) {
    parsed.commandStage = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "cmd_pending", field)) {
    parsed.commandPending = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "conn_state", field)) {
    parsed.connectivityState = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "lte_reconn_ms", field)) {
    parsed.lteReconnectMs = (unsigned long)field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "upload_active", field)) {
    parsed.photoUploadActive = (field.toInt() != 0);
    parsedAny = true;
  }
  if (parseDiagField(body, "upload_pct", field)) {
    parsed.photoUploadProgress = field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "upload_age", field)) {
    parsed.photoUploadAgeMs = (unsigned long)field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "cam_age", field)) {
    parsed.camAgeMs = (unsigned long)field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "ctrl_age", field)) {
    parsed.controllerAgeMs = (unsigned long)field.toInt();
    parsedAny = true;
  }
  if (parseDiagField(body, "uptime", field)) {
    parsed.proxyUptimeMs = (unsigned long)field.toInt();
    parsedAny = true;
  }

  if (!parsedAny) {
    netLog("[DIAG] GET /diag parse miss: '%s'\n", body.c_str());
    return false;
  }

  if (parsed.battPct < 0) parsed.battPct = 0;
  if (parsed.battPct > 100) parsed.battPct = 100;
  if (parsed.csq < -1) parsed.csq = -1;
  if (parsed.csq > 31) parsed.csq = 31;
  if (parsed.firebaseFailures < 0) parsed.firebaseFailures = 0;
  if (parsed.commandStage < 0) parsed.commandStage = 0;
  if (parsed.photoUploadProgress < 0) parsed.photoUploadProgress = 0;
  if (parsed.photoUploadProgress > 100) parsed.photoUploadProgress = 100;

  out = parsed;
  return true;
}

// ── Generic raw POST through persistent connection ──
// Reuses the keep-alive socket for fire-and-forget POSTs during the
// unlock flow, avoiding ~150ms TCP handshake per call.
static int sendRawPost(const char *path, const char *json) {
  ProxyIoGuard io("sendRawPost", 2500);
  if (!io.ok()) {
    return -2;
  }
  String uartBody;

  if (WiFi.status() != WL_CONNECTED) {
    if (proxyUartPrimaryRequest("POST", path, json, uartBody,
                                PROXY_UART_TIMEOUT_MS)) {
      return 200;
    }
    return -1;
  }
#if DISABLE_PROXY_KEEPALIVE
  if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(PROXY_DISCOVERY_FAST_MS) &&
      !probeLikelyProxyHosts(PROXY_SUBNET_PROBE_HOSTS + 6)) {
    return -1;
  }
  WiFiClient client;
  HTTPClient http;
  char url[96];
  snprintf(url, sizeof(url), "http://%s:%d%s", PROXY_HOST, PROXY_PORT, path);
  http.setTimeout(FETCH_HTTP_TIMEOUT_MS);
  http.begin(client, url);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Controller-Id", EXPECTED_CONTROLLER_ID);
  int code = http.POST((uint8_t *)json, strlen(json));
  http.end();
  return code;
#else
  if (!ensurePersistentConnection()) {
    return -1;
  }

  int jsonLen = strlen(json);
  persistentClient.printf(
      "POST %s HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "X-Controller-Id: %s\r\n"
      "Connection: keep-alive\r\n"
      "Content-Type: application/json\r\n"
      "Content-Length: %d\r\n"
      "\r\n"
      "%s",
      path, PROXY_HOST, PROXY_PORT, EXPECTED_CONTROLLER_ID, jsonLen, json);

  String body;
  int code = readHttpResponse(body, FETCH_HTTP_TIMEOUT_MS);

  if (code < 0) {
    netLog("[POST] %s failed — reconnecting\n", path);
    closePersistentConnection();
    if (!ensurePersistentConnection()) {
      return -1;
    }
    persistentClient.printf(
        "POST %s HTTP/1.1\r\n"
        "Host: %s:%d\r\n"
        "X-Controller-Id: %s\r\n"
        "Connection: keep-alive\r\n"
        "Content-Type: application/json\r\n"
        "Content-Length: %d\r\n"
        "\r\n"
        "%s",
        path, PROXY_HOST, PROXY_PORT, EXPECTED_CONTROLLER_ID, jsonLen, json);
    code = readHttpResponse(body, FETCH_HTTP_TIMEOUT_MS);
    if (code < 0) {
      closePersistentConnection();
      return -1;
    }
  }
  return code;
#endif
}

static bool enqueueProxyPost(const char *path, const char *json) {
  ensureProxyAsync();
  if (proxyPostQueue == NULL || path == NULL || json == NULL) return false;

