LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
  ProxyPostJob job;
  memset(&job, 0, sizeof(job));
  strncpy(job.path, path, sizeof(job.path) - 1);
  strncpy(job.json, json, sizeof(job.json) - 1);
  job.attempts = 0;

  if (xQueueSend(proxyPostQueue, &job, 0) != pdTRUE) {
    ProxyPostJob dropped;
    if (xQueueReceive(proxyPostQueue, &dropped, 0) == pdTRUE) {
      proxyPostDropCount++;
    }
    if (xQueueSend(proxyPostQueue, &job, 0) != pdTRUE) {
      proxyPostDropCount++;
      return false;
    }
  }
  proxyPostQueuedCount++;
  return true;
}

static void proxyPostTask(void *pvParameters) {
  (void)pvParameters;
  ProxyPostJob job;
  for (;;) {
    if (proxyPostQueue != NULL &&
        xQueueReceive(proxyPostQueue, &job, pdMS_TO_TICKS(250)) == pdTRUE) {
      int code = sendRawPost(job.path, job.json);
      if (code == 200 || code == 201) {
        proxyPostSentCount++;
      } else {
        proxyPostFailCount++;
        job.attempts++;
        if (job.attempts < 3) {
          vTaskDelay(pdMS_TO_TICKS(500 + (job.attempts * 500)));
          if (xQueueSend(proxyPostQueue, &job, 0) != pdTRUE) {
            proxyPostDropCount++;
          }
        }
      }
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

// ==================== REPORT EVENT ====================
bool reportEventToProxy(bool otpValid,
                        bool faceDetected,
                        bool unlocked,
                        bool thermalCutoff,
                        uint8_t faceAttempts,
                        bool faceRetryExhausted,
                        bool fallbackRequired,
                        const char *failureReason,
                        unsigned long unlockLatencyMs) {
  const char *safeReason =
      (failureReason != NULL && failureReason[0] != '\0') ? failureReason : "";

  char json[448];
  snprintf(json, sizeof(json),
           "{\"otp_valid\":%s,\"face_detected\":%s,\"unlocked\":%s,\"box_id\":"
           "\"%s\",\"delivery_id\":\"%s\",\"thermal_cutoff\":%s,"
           "\"face_attempts\":%u,\"face_retry_exhausted\":%s,"
           "\"fallback_required\":%s,\"failure_reason\":\"%s\","
           "\"unlock_latency_ms\":%lu}",
           otpValid ? "true" : "false", faceDetected ? "true" : "false",
           unlocked ? "true" : "false", HARDWARE_ID, activeDeliveryId,
           thermalCutoff ? "true" : "false", (unsigned int)faceAttempts,
           faceRetryExhausted ? "true" : "false",
           fallbackRequired ? "true" : "false", safeReason,
           unlockLatencyMs);

  bool queued = enqueueProxyPost("/event", json);
#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[EVENT] queued=%d\n", queued ? 1 : 0);
#endif

  return queued;
}

// ==================== ALERT REPORTING ====================
bool reportAlertToProxy(const char *alertType, const char *details) {
  char json[256];
  snprintf(json, sizeof(json),
           "{\"alert_type\":\"%s\",\"details\":\"%s\","
           "\"box_id\":\"%s\",\"delivery_id\":\"%s\"}",
           alertType, details, HARDWARE_ID, activeDeliveryId);

  bool queued = enqueueProxyPost("/event", json);
#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[ALERT] %s queued=%d\n", alertType, queued ? 1 : 0);
#endif

  return queued;
}

// ==================== TAMPER REPORT ====================
bool reportTamperToProxy() {
  char json[256];
  snprintf(json, sizeof(json),
           "{\"alert_type\":\"REED_TAMPER\",\"details\":\"lid_opened_no_unlock\","
           "\"box_id\":\"%s\",\"delivery_id\":\"%s\",\"tamper\":true}",
           HARDWARE_ID, activeDeliveryId);

  bool queued = enqueueProxyPost("/event", json);
#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[TAMPER] queued=%d\n", queued ? 1 : 0);
#endif

  return queued;
}

// ==================== COMMAND ACK REPORT ====================
bool reportCommandAckToProxy(const char *command, const char *status, const char *details) {
  char json[320];
  snprintf(json, sizeof(json),
           "{\"command\":\"%s\",\"status\":\"%s\",\"details\":\"%s\","
           "\"box_id\":\"%s\",\"delivery_id\":\"%s\"}",
           command ? command : "", status ? status : "", details ? details : "",
           HARDWARE_ID, activeDeliveryId);

  if (command && strcmp(command, "REBOOT_ALL") == 0) {
    int code = sendRawPost("/command-ack", json);
    if (code == 200 || code == 201) {
#if CONTROLLER_VERBOSE_LOGS
      Serial.printf("[CMD_ACK] %s/%s sent sync HTTP %d\n",
                    command, status ? status : "", code);
#endif
      return true;
    }
  }

  bool queued = enqueueProxyPost("/command-ack", json);
#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[CMD_ACK] %s/%s queued=%d\n", command ? command : "", status ? status : "", queued ? 1 : 0);
#endif

  return queued;
}

bool requestCameraPowerMode(bool wakeMode) {
  String uartBody;
  const char *path = wakeMode ? "/cam-power?mode=wake" : "/cam-power?mode=sleep";

  if (WiFi.status() != WL_CONNECTED) {
    if (proxyUartPrimaryRequest("GET", path, "", uartBody,
                                PROXY_UART_TIMEOUT_MS)) {
      uartBody.trim();
      return uartBody.indexOf("CAM_") >= 0 || uartBody.indexOf("OK") >= 0;
    }
    return false;
  }
  if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(PROXY_DISCOVERY_FAST_MS) &&
      !probeLikelyProxyHosts(PROXY_SUBNET_PROBE_HOSTS + 6)) {
    return false;
  }

  ProxyIoGuard io("requestCameraPowerMode", 250);
  if (!io.ok()) return false;

  HTTPClient http;
  char url[96];
  snprintf(url, sizeof(url), "http://%s:%d/cam-power?mode=%s", PROXY_HOST,
           PROXY_PORT, wakeMode ? "wake" : "sleep");

  http.setTimeout(2500);
  http.begin(url);
  http.addHeader("X-Controller-Id", EXPECTED_CONTROLLER_ID);
  int code = http.GET();

  bool ok = false;
  if (code == 200) {
    String body = http.getString();
    body.trim();
    ok = body.indexOf("CAM_") >= 0 || body.indexOf("OK") >= 0;
    netLog("[CAM] mode=%s proxy=%s\n", wakeMode ? "wake" : "sleep",
           body.c_str());
  } else {
    netLog("[CAM] mode=%s HTTP %d\n", wakeMode ? "wake" : "sleep", code);
  }

  http.end();
  return ok;
}

static int parsePersonalPinResponse(const String &body) {
  if (body.indexOf("ALLOW_UNLOCK") >= 0) return 1;
  if (body.indexOf("ALLOW_RELOCK") >= 0) return 2;
  if (body.indexOf("DENY:disabled") >= 0) return -3;
  if (body.indexOf("DENY:sync_failed") >= 0) return -4;
  if (body.indexOf("DENY:missing_pin") >= 0 ||
      body.indexOf("DENY:invalid") >= 0 ||
      body.indexOf("DENY:box_mismatch") >= 0) {
    return -1;
  }
  return 0;
}

