LorenzoBela/Ard-IDE/11_Controller_ESP32_Hotspot_FastGeo_Box002_Keypad/ProxyClient.cpp
int requestPersonalPinToggle(const char *pin, bool currentlyLocked) {
  if (!pin || pin[0] == '\0') {
    return 0;
  }

  char json[256];
  snprintf(json, sizeof(json),
           "{\"pin\":\"%s\",\"box_id\":\"%s\",\"delivery_id\":\"%s\","
           "\"currently_locked\":%s,\"source\":\"controller_keypad\"}",
           pin, HARDWARE_ID, activeDeliveryId, currentlyLocked ? "true" : "false");

  String uartBody;

  if (WiFi.status() != WL_CONNECTED) {
    if (proxyUartPrimaryRequest("POST", "/personal-pin-verify", json, uartBody,
                                PROXY_UART_TIMEOUT_MS)) {
      uartBody.trim();
      return parsePersonalPinResponse(uartBody);
    }
    return 0;
  }
  if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(PROXY_DISCOVERY_FAST_MS) &&
      !probeLikelyProxyHosts(PROXY_SUBNET_PROBE_HOSTS + 6)) {
    return -2;
  }

  ProxyIoGuard io("requestPersonalPinToggle", 250);
  if (!io.ok()) return -2;

  HTTPClient http;
  char url[96];
  snprintf(url, sizeof(url), "http://%s:%d/personal-pin-verify", PROXY_HOST,
           PROXY_PORT);

  http.setTimeout(5000);
  http.begin(url);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Controller-Id", EXPECTED_CONTROLLER_ID);
  int code = http.POST((uint8_t *)json, strlen(json));
  if (code != 200) {
#if CONTROLLER_VERBOSE_LOGS
    Serial.printf("[PIN] verify HTTP %d\n", code);
#endif
    http.end();
    return -2;
  }

  String body = http.getString();
  body.trim();
  http.end();

  int parsed = parsePersonalPinResponse(body);
  if (parsed != 0) {
    return parsed;
  }
  return 0;
}

// ==================== FACE CHECK ====================
int requestFaceCheck() {
  char facePath[128];
  if (strlen(activeDeliveryId) > 0 &&
      strcmp(activeDeliveryId, "NO_DELIVERY") != 0 &&
      strcmp(activeDeliveryId, "null") != 0) {
    snprintf(facePath, sizeof(facePath), "/face-check?delivery_id=%s", activeDeliveryId);
  } else {
    snprintf(facePath, sizeof(facePath), "/face-check");
  }

  String uartBody;

  // ── WiFi via proxy ──
  if (WiFi.status() == WL_CONNECTED) {
    if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(PROXY_DISCOVERY_FAST_MS) &&
        !probeLikelyProxyHosts(PROXY_SUBNET_PROBE_HOSTS + 6)) {
#if CONTROLLER_VERBOSE_LOGS
      Serial.println(F("[FACE] Proxy discovery failed"));
#endif
    } else {
    ProxyIoGuard io("requestFaceCheck", 250);
    if (!io.ok()) return -1;
    HTTPClient http;
    char url[128];
    if (strlen(activeDeliveryId) > 0 &&
        strcmp(activeDeliveryId, "NO_DELIVERY") != 0 &&
        strcmp(activeDeliveryId, "null") != 0) {
      snprintf(url, sizeof(url), "http://%s:%d/face-check?delivery_id=%s",
               PROXY_HOST, PROXY_PORT, activeDeliveryId);
    } else {
      snprintf(url, sizeof(url), "http://%s:%d/face-check", PROXY_HOST,
               PROXY_PORT);
    }

    http.setTimeout(FACE_CHECK_WIFI_TIMEOUT_MS);
    http.begin(url);
    http.addHeader("X-Controller-Id", EXPECTED_CONTROLLER_ID);
    int code = http.GET();

    if (code == 200) {
      String body = http.getString();
      body.trim();
      http.end();

      if (body.indexOf("FACE_OK") >= 0) return 1;
      if (body.indexOf("NO_FACE_LOW_LIGHT") >= 0) return 2;
      if (body.indexOf("NO_FACE") >= 0) return 0;

#if CONTROLLER_VERBOSE_LOGS
      Serial.printf("[FACE] HTTP 200 but body error: %s\n", body.c_str());
#endif
    } else {
#if CONTROLLER_VERBOSE_LOGS
      Serial.printf("[FACE] HTTP %d\n", code);
#endif
      http.end();
    }
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    return -1;
  }

  // ── Fallback: UART Serial2 to ESP32-CAM directly ──
#if CONTROLLER_VERBOSE_LOGS
      Serial.println(F("[FACE] WiFi down — trying UART fallback..."));
#endif

  if (proxyUartPrimaryRequest("GET", facePath, "", uartBody,
                              FACE_CHECK_WIFI_TIMEOUT_MS)) {
    uartBody.trim();
    if (uartBody.indexOf("FACE_OK") >= 0) return 1;
    if (uartBody.indexOf("NO_FACE_LOW_LIGHT") >= 0) return 2;
    if (uartBody.indexOf("NO_FACE") >= 0) return 0;
  }

  // Flush stale data
  while (Serial2.available()) Serial2.read();

  if (strlen(activeDeliveryId) > 0 &&
      strcmp(activeDeliveryId, "NO_DELIVERY") != 0 &&
      strcmp(activeDeliveryId, "null") != 0) {
    Serial2.printf("FACE?,%s\n", activeDeliveryId);
  } else {
    Serial2.println("FACE?");
  }

  unsigned long uartStart = millis();
  char uartBuf[32] = "";
  uint8_t uartLen = 0;

  while (millis() - uartStart < FACE_CHECK_UART_TIMEOUT_MS) {
    if (Serial2.available()) {
      char c = Serial2.read();
      if (c == '\n' || c == '\r') {
        if (uartLen > 0) break;
      } else if (uartLen < sizeof(uartBuf) - 1) {
        uartBuf[uartLen++] = c;
      }
    }
    // Yield CPU without blocking scheduler; keep retry paths millis-driven.
    yield();
  }
  uartBuf[uartLen] = '\0';

#if CONTROLLER_VERBOSE_LOGS
  Serial.printf("[FACE] UART response: '%s'\n", uartBuf);
#endif

  if (strstr(uartBuf, "FACE_OK") != NULL) return 1;
  if (strstr(uartBuf, "NO_FACE_LOW_LIGHT") != NULL) return 2;
  if (strstr(uartBuf, "NO_FACE") != NULL) return 0;

#if CONTROLLER_VERBOSE_LOGS
  Serial.println(F("[FACE] UART fallback failed"));
#endif
  return -1;
}
